//展示原料辅料的每日消耗情况

import { ScrollBoard } from '@jiaminghi/data-view-react';

const RawConsumption = () => {
  const config = {
    header: ['日期', '种类', '消耗量'],
    data: [
      ['2024-01-01', '烟叶', '120'],
      ['2024-01-01', '加香剂', '220'],
      ['2024-01-01', '填充剂', '150'],
      ['2024-01-01', '滤嘴', '320'],
      ['2024-01-01', '纸张', '130'],
      ['2024-01-01', '胶水', '120'],
      ['2024-01-01', '添加剂', '220'],
      ['2024-01-01', '印刷油墨', '150'],
      ['2024-01-02', '烟叶', '120'],
      ['2024-01-02', '加香剂', '220'],
      ['2024-01-02', '填充剂', '150'],
      ['2024-01-02', '滤嘴', '320'],
      ['2024-01-02', '纸张', '130'],
      ['2024-01-02', '胶水', '120'],
      ['2024-01-02', '添加剂', '220'],
      ['2024-01-02', '印刷油墨', '150'],
    ],
    headerBGC: '#00fff138',
    oddRowBGC: '#00000017',
    evenRowBGC: '#ededed13',
    headerHeight: 28,
    rowNum: 5,
    columnWidth: [200, 200, 200],
  };
  return (
    <ScrollBoard
      config={config}
      style={{ width: '100%', height: '220px', fontSize: '12px', marginBottom: '8px' }}
    />
  );
};

export default RawConsumption;
